app/controllers/muziks_controller.rb

  def index
    @muziks = Muzik.all
---
SELECT "muziks".* FROM "muziks"

  def create
    @muzik = Muzik.new(muzik_params)

    respond_to do |format|
      if @muzik.save
---
INSERT INTO "muziks" ("created_at", "length_min", "length_sec", "name", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-07-29 01:04:29.987799"], ["length_min", 3], ["length_sec", 14], ["name", "Brian's Song"], ["size", 10], ["updated_at", "2014-07-29 01:04:29.987799"]]

  def destroy
    @muzik.destroy
---
DELETE FROM "muziks" WHERE "muziks"."id" = ?  [["id", 1]]

    def set_muzik
      @muzik = Muzik.find(params[:id])
---
SELECT  "muziks".* FROM "muziks"  WHERE "muziks"."id" = ? LIMIT 1  [["id", 2]]